Neurotech-Hub/arduino-esp32-hub/boards.txt
esp32h2.menu.ZigbeeMode.default=Disabled
esp32h2.menu.ZigbeeMode.default.build.zigbee_mode=
esp32h2.menu.ZigbeeMode.default.build.zigbee_libs=
esp32h2.menu.ZigbeeMode.ed=Zigbee ED (end device)
esp32h2.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32h2.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api_ed -lesp_zb_cli_command -lzboss_stack.ed -lzboss_port
esp32h2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32h2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32h2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port
esp32h2.menu.ZigbeeMode.rcp=Zigbee RCP (radio co-processor)
esp32h2.menu.ZigbeeMode.rcp.build.zigbee_mode=-DZIGBEE_MODE_RCP
esp32h2.menu.ZigbeeMode.rcp.build.zigbee_libs=-lesp_zb_api_rcp -lesp_zb_cli_command -lzboss_stack.rcp -lzboss_port


##############################################################

esp32c6.name=ESP32C6 Dev Module

esp32c6.bootloader.tool=esptool_py
esp32c6.bootloader.tool.default=esptool_py

esp32c6.upload.tool=esptool_py
esp32c6.upload.tool.default=esptool_py
esp32c6.upload.tool.network=esp_ota

esp32c6.upload.maximum_size=1310720
esp32c6.upload.maximum_data_size=327680
esp32c6.upload.flags=
esp32c6.upload.extra_flags=
esp32c6.upload.use_1200bps_touch=false
esp32c6.upload.wait_for_upload_port=false

esp32c6.serial.disableDTR=false
esp32c6.serial.disableRTS=false

esp32c6.build.tarch=riscv32
esp32c6.build.target=esp
esp32c6.build.mcu=esp32c6
esp32c6.build.core=esp32
esp32c6.build.variant=esp32c6
esp32c6.build.board=ESP32C6_DEV
esp32c6.build.bootloader_addr=0x0

esp32c6.build.cdc_on_boot=0
esp32c6.build.f_cpu=160000000L
esp32c6.build.flash_size=4MB
esp32c6.build.flash_freq=80m
esp32c6.build.flash_mode=qio
esp32c6.build.boot=qio
esp32c6.build.partitions=default
esp32c6.build.defines=

## IDE 2.0 Seems to not update the value
esp32c6.menu.JTAGAdapter.default=Disabled
esp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
esp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32c6.menu.JTAGAdapter.external=FTDI Adapter
esp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
esp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
esp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32c6.menu.CDCOnBoot.default=Disabled
esp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32c6.menu.CDCOnBoot.cdc=Enabled
esp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32c6.menu.PartitionScheme.default.build.partitions=default
esp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32c6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32c6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32c6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
esp32c6.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
esp32c6.menu.PartitionScheme.no_fs.build.partitions=no_fs
esp32c6.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
esp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32c6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32c6.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32c6.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32c6.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32c6.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32c6.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32c6.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
esp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
esp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
esp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
esp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
esp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
esp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
esp32c6.menu.PartitionScheme.custom=Custom
esp32c6.menu.PartitionScheme.custom.build.partitions=
esp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

