Neurotech-Hub/arduino-esp32-hub/boards.txt
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.none=None
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.error=Error
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.info=Info
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s2_reversetft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s2_reversetft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s2_reversetft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s2_reversetft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s2_reversetft.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.default=Disabled
adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_feather_esp32s2_reversetft.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################
# Adafruit Feather ESP32-S3 2MB PSRAM

adafruit_feather_esp32s3.name=Adafruit Feather ESP32-S3 2MB PSRAM
adafruit_feather_esp32s3.vid.0=0x239A
adafruit_feather_esp32s3.pid.0=0x811B
adafruit_feather_esp32s3.vid.1=0x239A
adafruit_feather_esp32s3.pid.1=0x011B
adafruit_feather_esp32s3.vid.2=0x239A
adafruit_feather_esp32s3.pid.2=0x811C
adafruit_feather_esp32s3.upload_port.0.vid=0x239A
adafruit_feather_esp32s3.upload_port.0.pid=0x811B
adafruit_feather_esp32s3.upload_port.1.vid=0x239A
adafruit_feather_esp32s3.upload_port.1.pid=0x011B
adafruit_feather_esp32s3.upload_port.2.vid=0x239A
adafruit_feather_esp32s3.upload_port.2.pid=0x811C

adafruit_feather_esp32s3.bootloader.tool=esptool_py
adafruit_feather_esp32s3.bootloader.tool.default=esptool_py

adafruit_feather_esp32s3.upload.tool=esptool_py
adafruit_feather_esp32s3.upload.tool.default=esptool_py
adafruit_feather_esp32s3.upload.tool.network=esp_ota

adafruit_feather_esp32s3.upload.maximum_size=1310720
adafruit_feather_esp32s3.upload.maximum_data_size=327680
adafruit_feather_esp32s3.upload.flags=
adafruit_feather_esp32s3.upload.extra_flags=
adafruit_feather_esp32s3.upload.use_1200bps_touch=true
adafruit_feather_esp32s3.upload.wait_for_upload_port=true

adafruit_feather_esp32s3.serial.disableDTR=false
adafruit_feather_esp32s3.serial.disableRTS=false

adafruit_feather_esp32s3.build.tarch=xtensa
adafruit_feather_esp32s3.build.bootloader_addr=0x0
adafruit_feather_esp32s3.build.target=esp32s3
adafruit_feather_esp32s3.build.mcu=esp32s3
adafruit_feather_esp32s3.build.core=esp32
adafruit_feather_esp32s3.build.variant=adafruit_feather_esp32s3
adafruit_feather_esp32s3.build.board=ADAFRUIT_FEATHER_ESP32S3

adafruit_feather_esp32s3.build.usb_mode=0
adafruit_feather_esp32s3.build.cdc_on_boot=1
adafruit_feather_esp32s3.build.msc_on_boot=0
adafruit_feather_esp32s3.build.dfu_on_boot=0
adafruit_feather_esp32s3.build.f_cpu=240000000L
adafruit_feather_esp32s3.build.flash_size=4MB
adafruit_feather_esp32s3.build.flash_freq=80m
adafruit_feather_esp32s3.build.flash_mode=dio
adafruit_feather_esp32s3.build.boot=qio
adafruit_feather_esp32s3.build.partitions=default
adafruit_feather_esp32s3.build.defines=
adafruit_feather_esp32s3.build.loop_core=
adafruit_feather_esp32s3.build.event_core=
adafruit_feather_esp32s3.build.flash_type=qio
adafruit_feather_esp32s3.build.psram_type=qspi
adafruit_feather_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_feather_esp32s3.menu.LoopCore.1=Core 1
adafruit_feather_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_feather_esp32s3.menu.LoopCore.0=Core 0
adafruit_feather_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_feather_esp32s3.menu.EventsCore.1=Core 1
adafruit_feather_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_feather_esp32s3.menu.EventsCore.0=Core 0
adafruit_feather_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_feather_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_feather_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_feather_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_feather_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_feather_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s3.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s3.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_feather_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_feather_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false

