Neurotech-Hub/arduino-esp32-hub/boards.txt
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio=QIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120=QIO 120MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio=DIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi=OPI 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_mode=dout
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot=opi
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_freq=80m

adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M=4MB (32Mb)
adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M.build.flash_size=4MB

adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none=None
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error=Error
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info=Info
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.default=Disabled
adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_feather_esp32s3_reversetft.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

#############################
# Feather C6


adafruit_feather_esp32c6.name=Adafruit Feather ESP32-C6

adafruit_feather_esp32c6.bootloader.tool=esptool_py
adafruit_feather_esp32c6.bootloader.tool.default=esptool_py

adafruit_feather_esp32c6.upload.tool=esptool_py
adafruit_feather_esp32c6.upload.tool.default=esptool_py
adafruit_feather_esp32c6.upload.tool.network=esp_ota

adafruit_feather_esp32c6.upload.maximum_size=1310720
adafruit_feather_esp32c6.upload.maximum_data_size=327680
adafruit_feather_esp32c6.upload.flags=
adafruit_feather_esp32c6.upload.extra_flags=
adafruit_feather_esp32c6.upload.use_1200bps_touch=false
adafruit_feather_esp32c6.upload.wait_for_upload_port=false

adafruit_feather_esp32c6.serial.disableDTR=false
adafruit_feather_esp32c6.serial.disableRTS=false

adafruit_feather_esp32c6.build.tarch=riscv32
adafruit_feather_esp32c6.build.target=esp
adafruit_feather_esp32c6.build.mcu=esp32c6
adafruit_feather_esp32c6.build.core=esp32
adafruit_feather_esp32c6.build.variant=adafruit_feather_esp32c6
adafruit_feather_esp32c6.build.board=ADAFRUIT_FEATHER_ESP32C6
adafruit_feather_esp32c6.build.bootloader_addr=0x0

adafruit_feather_esp32c6.build.cdc_on_boot=0
adafruit_feather_esp32c6.build.f_cpu=160000000L
adafruit_feather_esp32c6.build.flash_size=4MB
adafruit_feather_esp32c6.build.flash_freq=80m
adafruit_feather_esp32c6.build.flash_mode=qio
adafruit_feather_esp32c6.build.boot=qio
adafruit_feather_esp32c6.build.partitions=default
adafruit_feather_esp32c6.build.defines=

## IDE 2.0 Seems to not update the value
adafruit_feather_esp32c6.menu.JTAGAdapter.default=Disabled
adafruit_feather_esp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
adafruit_feather_esp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
adafruit_feather_esp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
adafruit_feather_esp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
adafruit_feather_esp32c6.menu.JTAGAdapter.external=FTDI Adapter
adafruit_feather_esp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
adafruit_feather_esp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
adafruit_feather_esp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
adafruit_feather_esp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
adafruit_feather_esp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

